package day0609;

public class Ex01Naming {

    // 자바의 명명규칙
    // 공통규칙
    // 1. 모든 읾은 대소문자가 엄격하게 구분된다.
    // 2. 이름의 중간이나 맨 끝에는 숫자가 들어갈 수 있지만 숫자로 이름을 시작할 수 없다.
    // 3. _를 제외한 모든 특수문자는 사용 할 수 없다.
    // 4. 자바에서는 내부적으로 기능이 정의되어있는 50가지의 키워드가 존재한다..
    // 해당 키워드로는 이름을 만들 수 없으므로 외워야한다. -> 내일 오후 3시 시험 예정.
    // 이제는 이클립스에서 보라색으로 표시가 되므로 더이상 외울 필요없다.
    // 만약 여러분들이 이름 지은 것이 보라색으로 표시되면 추가적인
    // 단어를 붙이거나 대소문자를 다르게하여 만들어주면 된다.

    // 낙타등표기법과 뱀표기법법
    // 낙타등표기법 : 만약 이름이 여러단어일 경우 두번째 단어부터는
    // 쉽게 단어 구분을 하기 위해 첫 글자를 대문자로 적어준다.
    // 뱀표기법 :  만약 모든 철자를 대문자로 적는 경우, 단어간의 구분을
    // 해주기 위해서 사이에 _를 넣어주는 표기법이다.

    // 각종 개념에 대한 명명법
    // 1. 패키지 : 내부에 포함된 클래스들의 성격을 나타내는 한 단어. 소문자로 시작한다.
    // 2. 클래스 : 대문자로 시작하고 낙타등 표기법을 사용하는 명사.
    // 3. 메소드 : 소문자로 시작하고 낙타등 표기법을 사용하는 동사.
    // 4. 변수 : 소문자로 시작하고 낙타등 표기법을 사용하는 명사.
    // 5. 상수 : 뱀 표기법을 사용하는 명사. final을 붙여준다.
    // (PI, max_size)

    // 데이터 타입 :기본형, 참조형
    // 기본형 : byte , char, short, int, long, float, double, boolean
    // 참조형 : 배열 타입입, 열 타입, class 타입, interface 타입

    //
}
